brew "chezmoi"
brew "git"
brew "vim"
brew "nvim"
brew "less" # to support configuration via a .lesskey file

brew "eza"
brew "macos-trash"
brew "ripgrep"
brew "jq"
brew "bat"
brew "tree"
brew "fd"
brew "httpie"
brew "lynx"
brew "icdiff"
brew "diff-so-fancy"
cask "devtoys"
brew "jless"
brew "cheat"
brew "doggo"
brew "lolcat"
brew "gh"
brew "delta"
brew "git-delta"
brew "git-absorb"

brew "node"
brew "yarn"
brew "npm"

brew "gpg"
brew "gpg2"
brew "cmake"

brew "adr-tools"
brew "ffmpeg"
brew "brew-gem"
brew "rectangle"
brew "obsidian"
brew "visual-studio-code"
brew "starship"
brew "just"
brew "fzf"
cask "raycast"
brew "devcontainer"

cask "font-sauce-code-pro-nerd-font"
