# Core utilities
brew "chezmoi"
brew "mas"
brew "git"
brew "nvim"
brew "just"

# Build tools
brew "libyaml"
brew "cmake"
brew "mise"

brew "gpg"
brew "gpg2"
cask "docker"
cask "1password-cli"

# Command line improvements
brew "starship"
brew "less" # to support configuration via a .lesskey file
brew "fzf"
brew "eza"
brew "ripgrep"
brew "jq"
brew "bat"
brew "tree"
brew "fd"
brew "lynx"
brew "icdiff"
brew "diff-so-fancy"
brew "jless"
brew "delta"
brew "git-delta"

# Development tools
cask "visual-studio-code"
brew "devcontainer"
brew "vscli"
brew "httpie"
brew "gh"
brew "adr-tools"
cask "devtoys"
cask "font-sauce-code-pro-nerd-font"
cask "google-cloud-sdk"
brew "heroku"

# Mac apps
cask "rectangle"
cask "obsidian"
cask "raycast"
cask "cleanshot"
cask "netnewswire"
mas "Things 3", id: 904280696
mas "Acorn 8", id: 6737921844
mas "1Password for Safari", id: 1569813296
mas "Obsidian Web Clipper", id: 6720708363
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "Sequel Ace", id: 1518036000
mas "JSON Peep for Safari", id: 1458969831
mas "Ivory for Mastodon by Tapbots", id: 6444602274
# Slack is pre-installed on work Mac and hangs here
#mas "Slack for Desktop", id: 803453959

# Misc
brew "ffmpeg"
brew "ollama"
mas "fullmoon: local intelligence", id: 6727014156
cask "google-drive"
