brew "chezmoi"
brew "git"
brew "vim"
brew "nvim"
brew "less" # to support configuration via a .lesskey file

brew "exa"
brew "macos-trash"
brew "ripgrep"
brew "jq"
brew "bat"
brew "tree"
brew "fd"
brew "httpie"
brew "lynx"
brew "icdiff"
brew "diff-so-fancy"
cask "devtoys"
brew "jless"
brew "cheat"
brew "doggo"
brew "lolcat"
brew "gh"
brew "git-delta"

brew "node"
brew "yarn"
brew "npm"

brew "gpg"
brew "cmake"

brew "adr-tools"
brew "yt-dip"
brew "ffmpeg"
brew "brew-gem"
brew "git_fame"
